package Task;

/**
 * Задача:
 * Банки - банк отправляем запрос другим банкам о заемщике
 * Банки отвечают на запрос и отправляют информацию банку
 * https://skr.sh/sCxkxp4OFO8?a
 * Вход: Несколько менеджеров. Каждый менеджер подготавливает списки клиентов.
 * Сначала нужно объединить списки по банкам, куда они должны быть направлены
 * Убираем тех, по кому уже были отправлены запросы
 * Формируем сопроводительные письма
 * Отправляем сообщения в банки
 * Резюме: Манипуляция с данными
 * Объединения списка
 * Группировка по признаку
 * Фильтрация
 * Преобразование
 */

public class Main {
}
